config.org
#+STARTUP: overview
#+TITLE: Sean's Emacs Settings
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el :mkdirp yes
#+CREATOR: Sean Bergstedt

* DESKTOP SETTINGS
** HEADER INFO
#+begin_src emacs-lisp
  ;; NOTE: init.el is generated from config.org.  Edit that file in
  ;; Emacs and init.el will automatically be generated!
#+end_src

** Basic UI Settings
#+begin_src emacs-lisp
  ;; adjust thist for your system
  (defvar runemacs/default-font-size 125)
  (defvar runemacs/default-variable-font-size 125)

  ;; make frame transparency overridable
  (defvar runemacs/frame-transparency '(90 . 90))

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  (defun efs/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
	     (format "%.2f seconds"
		     (float-time
		      (time-subtract after-init-time before-init-time)))
	     gcs-done))
  (add-hook 'emacs-startup-hook #'efs/display-startup-time)

  ;; Stop showing the welcome screen
  (setq inhibit-startup-screen t)
  ;; Deactivate bell
  (setq visible-bell 1)
  ;; make sure line numbers apear in all text editing buffers
  (global-linum-mode t)
  ;; setup starting frame dimensions
  (setq initial-frame-alist '((top . 40) (left . 100) (width . 128) (height . 40)))
  #+end_src
  
** Package Resources Setup
#+begin_src emacs-lisp

  (require 'package)
  (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("melpa-stable" . "https://stable.melpa.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

** Customize Theme
#+begin_src emacs-lisp
  ;; custuomize theme
  (when (require 'gruvbox-theme nil 'noerror)
    (load-theme 'gruvbox-dark-medium t))
#+end_src
** Font Configurations
#+begin_src emacs-lisp
  (set-face-attribute 'default nil :family "DejaVu Sans Mono" :height runemacs/default-font-size)
  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :family "DejaVu Sans Mono" :height runemacs/default-font-size)
  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :family "DejaVu Sans Mono" :height runemacs/default-font-size :weight 'regular )
#+end_src
** Keep Folders Clean
Send all suffixed tilde files to a pre-determined destination for future reference
#+begin_src emacs-lisp
  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups" user-emacs-directory))))
#+end_src
* CUSTOM VARIABLES & USE-PACKAGE
** setup custom variables
#+begin_src emacs-lisp
  ;; --------------------------------------------------
  ;; Setup custom variables
  ;; --------------------------------------------------
  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(blink-cursor-mode nil)
   ;; '(custom-enabled-themes (quote (twilight-anti-bright)))
   '(custom-enabled-themes (quote (gruvbox-dark-medium)))
   '(custom-safe-themes
     (quote
      ("3c68f48ea735abe65899f489271d11cbebbe87da7483acf9935ea4502efd0117" "b25040da50ef56b81165676fdf1aecab6eb2c928fac8a1861c5e7295d2a8d4dd" "95db78d85e3c0e735da28af774dfa59308db832f84b8a2287586f5b4f21a7a5b" "e6d83e70d2955e374e821e6785cd661ec363091edf56a463d0018dc49fbc92dd" default)))
   '(menu-bar-mode nil)
   '(package-archives
     (quote
      (("gnu" . "http://elpa.gnu.org/packages/")
       ("" . "https://stable.melpa.org/packages/"))))
   '(package-selected-packages
     (quote
      (ox-twbs htmlize yaml-mode ess poly-R r-autoyas python paredit geiser multi-term gruvbox-theme exwm alchemist))) ;twilight-anti-bright-theme
   '(tool-bar-mode nil))
#+END_SRC
** install theme
#+begin_src emacs-lisp
  (use-package gruvbox-theme
    :ensure t)
#+end_src
** setup vertico mode
#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :custom
    (vertico-cycle t)
    :init
    (vertico-mode))
#+end_src
** setup savehistory for vertico
#+begin_src emacs-lisp
  (use-package savehist
    :init
    (savehist-mode))
#+end_src
** setup marginalia for vertico
#+begin_src emacs-lisp
  (use-package marginalia
    :after vertico
    :ensure t
    :custom
    (marginalia-annotators
     '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))
#+end_src

* DEV TOOL PACKAGES
** setup helpful (more helpful help menu for emacs)
#+begin_src emacs-lisp
  (use-package helpful
    :ensure t
    :bind (("C-h F" . helpful-function)
	   ("C-h V" . helpful-variable)
	   ("C-c C-d" . helpful-at-point)))
#+end_src
** setup magit
#+begin_src emacs-lisp
  ;; (use-package magit
  ;;   :ensure t)
#+end_src
** setup company (for text completion framework--inactive)
#+begin_src emacs-lisp
  ;; (use-package company
  ;;   :ensure t)
#+end_src
** setup flycheck (on-the-fly syntax checking extension-inactive)
#+begin_src emacs-lisp
  ;; (use-package flycheck
  ;;   :ensure t
  ;;   :init (global-flycheck-mode))
  ;; (use-package flycheck-rust
  ;;   :ensure t)
#+end_src
** language server LSP
#+begin_src emacs-lisp
  ;; (use-package lsp-mode
  ;;   :ensure t
  ;;   :commands (lsp lsp-deferred)
  ;;   :init
  ;;   (setq lsp-keymap-prefix "C-c l"))
  ;; :config
  ;; (lsp-enable-which-key-intergration t))
#+end_src
*** Java
#+begin_src emacs-lisp
  ;; --- NOT SURE HOW TO PROPERLY SET THIS UP SO COMMENTING OUT
  ;; (use-package lsp-java
  ;;   :ensure t
  ;;   :init
  ;;   (setq lsp-java-java-path "/c/Users/SeanBergstedt/jdk-16.0.2/bin/java.exe")
  ;;   :config
  ;;   (add-hook 'java-mode-hook #'lsp))
#+end_src
** enable previewing http sites
#+begin_src emacs-lisp
  ;; (require 'simple-httpd)
  (use-package simple-httpd
    :ensure t)
#+end_src
** setup websocket
#+begin_src emacs-lisp
  (use-package websocket
    :ensure t)
#+end_src
** structure templates for source block code
#+begin_src emacs-lisp
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
#+end_src
* CUSTOM PACKAGES
** SimTalk Mode
Tell emacs where your persona elisp lib directory is located
#+begin_src emacs-lisp
  (add-to-list `load-path "~/.emacs.d/lisp/")
#+END_SRC
Best not to include ending ".el" or ".elc"
#+begin_src emacs-lisp
  (load "stm-mode")
#+END_SRC
* CUSTOM LANGUAGE SETTINGS
** elixir settings: require alchemist on start-up for elixir
#+begin_src emacs-lisp
  ;; (add-to-list 'load-path "~/.emacs.d/vendor/alchemist.el/")
  (use-package alchemist
    :ensure t)
  ;; (require 'alchemist)
#+END_SRC
** erlang settings:
#+begin_src emacs-lisp
  ;; ;; add the location of the elisp files to the load-path
  ;; (setq load-path (cons  "/usr/lib/erlang/lib/tools-2.6.13/emacs"
  ;;          load-path))
  ;; ;; set the location of the man page hierarchy
  ;; (setq erlang-root-dir "/usr/lib/erlang")
  ;; ;; add the home of the erlang binaries to the exec-path
  ;; (setq exec-path (cons "/usr/lib/bin" exec-path))
  ;; ;; load and eval the erlang-start package to set up 
  ;; ;; everything else 
  ;; (require 'erlang-start)
#+END_SRC
** R settings: set R as program for ess
#+begin_src emacs-lisp
  (setq inferior-ess-r-program "R")
  (add-hook 'ess-mode-hook
	    (lambda () 
	      (ess-toggle-underscore nil)))
#+END_SRC
** java settings
#+begin_src emacs-lisp
  (add-hook 'java-mode-hook (lambda ()
			      (setq c-basic-offset 2
				    tab-width 2
				    indent-tabs-mode t)))
#+END_SRC
** common lisp settings: sbcl
#+begin_src emacs-lisp
  ;;(load (expand-file-name "~/quicklisp/slime-helper.el"))
  ;; Replace "sbcl" with the path to your implementation
  ;;(setq inferior-lisp-program "sbcl")
#+END_SRC
** simtalk: setup files ending in ".stm" to open in mystm-mode
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.stm\\'" . mystm-mode))
  (when (fboundp 'mystm-mode)

    (defun my-insert-tab-char ()
      "Insert a tab char. (ASCII 9, \t)"
      (interactive)
      (insert "\t"))

    (defun my-tab-config ()
      ;; setup tab char behavior
      (local-set-key (kbd "TAB") 'my-insert-tab-char)  
      )

    (add-hook 'mystm-mode-hook 'my-tab-config)
    )
#+END_SRC
** rust settings for racer
#+begin_src emacs-lisp
  (add-hook 'rust-mode-hook #'racer-mode)
  (add-hook 'racer-mode-hook #'eldoc-mode)
  (add-hook 'racer-mode-hook #'company-mode)
  (use-package rust-mode
    :ensure t)
  ;; (require 'rust-mode)
  (define-key rust-mode-map(kbd "TAB") #'company-indent-or-complete-common)
  (setq company-tooltip-align-annotations t)
#+END_SRC
* EXTRA KEY BINDINGS
