config.org
** fill width comment line break
#+begin_src emacs-lisp
  (defun comment-line-break (&optional arg)
    "Add dashed line break comment"
    (interactive "*P")
    (comment-normalize-vars)
    (if (and (not (region-active-p)) (not (looking-at "[ \t]*$")))
	(comment-or-uncomment-region (line-beginning-position) (line-end-position))
      (comment-dwim arg))
    (insert-char ?- 50))
  ;; (insert-char ? 20))
  (global-set-key (kbd "C-M-;") `comment-line-break)
#+END_SRC
** fill width comment box
#+begin_src emacs-lisp
  (defun bjm-comment-box (b e)
    "draw a box comment around the region but arrange for the region to extend to at least the fill column.
  place the point after the comment box."
    (interactive "r")
    (let ((e (copy-marker e t)))
      (goto-char b)
      (end-of-line)
      (insert-char ? (- fill-column (current-column)))
      (comment-box b e 1)
      (goto-char e)
      (set-marker e nil)))
  ;; create comment box
  (global-set-key (kbd "C-c b b") `bjm-comment-box)
#+END_SRC
** helper used by move-text-* functions
#+begin_src emacs-lisp
  (defun move-text-internal (arg)
    (cond
     ((and mark-active transient-mark-mode)
      (if (> (point) (mark))
	  (exchange-point-and-mark))
      (let ((column (current-column))
	    (text (delete-and-extract-region (point) (mark))))
	(forward-line arg)
	(move-to-column column t)
	(set-mark (point))
	(insert text)
	(exchange-point-and-mark)
	(setq deactivate-mark nil)))
     (t
      (let ((column (current-column)))
	(beginning-of-line)
	(when (or (> arg 0) (not (bobp)))
	  (forward-line)
	  (when (or (< arg 0) (not (eobp)))
	    (transpose-lines arg)
	    (when (and (eval-when-compile
			 '(and (>= emacs-major-version 24)
			       (>= emacs-minor-version 3)))
		       (< arg 0))
	      (forward-line -1)))
	  (forward-line -1))
	(move-to-column column t)))))
#+END_SRC
** move line down:  M-S-down
#+begin_src emacs-lisp
  (defun move-text-down (arg)
    "Move region (transient-mark-mode active) or current line
    arg lines down."
    (interactive "*p")
    (move-text-internal arg))
  (global-set-key [M-S-down] 'move-text-down)
#+END_SRC
** move line up: M-S-up
#+begin_src emacs-lisp
  (defun move-text-up (arg)
    "Move region (transient-mark-mode active) or current line
    arg lines up."
    (interactive "*p")
    (move-text-internal (- arg)))
  (global-set-key [M-S-up] 'move-text-up)
#+END_SRC
* ORG MODE SETTINGS
** auto-tangle config files
#+begin_src emacs-lisp
  ;; automatically tangle our config.org file when we save it
  (defun efs/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
			(expand-file-name "~/.emacs.d/config.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
	(org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src
** enable org mode and make org mode work with files ending in .org
#+begin_src emacs-lisp
  ;; Enable Org mode
  (require 'org)
  ;; Make Org mode work with files ending in .org
  ;; (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
  ;; The above is the default in recent emacs
  (define-key global-map "\C-cl" 'org-store-link)
  (define-key global-map "\C-ca" 'org-agenda)
  (setq org-log-done t)
  (add-hook 'org-mode-hook #'visual-line-mode) ;line wrap
  (setq org-hide-leading-stars t)
  ;; source code tab works on native language within src block
  (setq org-src-tab-acts-natively t)
#+END_SRC
** setup org todo keywords
#+begin_src emacs-lisp
  (setq org-todo-keywords '((sequence "TODO(t)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")))
#+END_SRC
** export html setup
#+begin_src emacs-lisp
  (setq org-html-htmlize-output-type 'css)
#+END_SRC
** twitter bootstrap
#+begin_src emacs-lisp
  ;; (require 'ox-twbs)
  (use-package ox-twbs
    :ensure t)
#+END_SRC
** enable export of latex
#+begin_src emacs-lisp
  (require 'ox-latex)			;manually saved to elpa folder
  (unless (boundp 'org-latex-classes)
    (setq org-latex-classes nil))
  ;; (add-to-list 'org-latex-classes
  ;;              '("article"
  ;;                "\\documentclass{article}"
  ;;                ("\\section{%s}" . "\\section*{%s}")))
  ;; --------------------------------------------------
  ;; the original modifications
  (add-to-list 'org-latex-classes
	       '("article"
		 "\\documentclass{article}"
		 ("\\section{%s}" . "\\section*{%s}")
		 ("\\subsection{%s}" . "\\subsection*{%s}")
		 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
		 ("\\paragraph{%s}" . "\\paragraph*{%s}")
		 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
  ;; (add-to-list 'org-latex-classes
  ;; 	     '("book"
  ;; 	       "\\documentclass{book}"
  ;; 	       ("\\part{%s}" . "\\part*{%s}")
  ;; 	       ("\\chapter{%s}" . "\\chapter*{%s}")
  ;; 	       ("\\section{%s}" . "\\section*{%s}")
  ;; 	       ("\\subsection{%s}" . "\\subsection*{%s}")
  ;; 	       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
  ;; --------------------------------------------------
  ;; (with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-classes
	       '("org-plain-latex"
		 "\\documentclass{article}
	     [NO-DEFAULT-PACKAGES]
	     [PACKAGES]
	     [EXTRA]"
		 ("\\section{%s}" . "\\section*{%s}")
		 ("\\subsection{%s}" . "\\subsection*{%s}")
		 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
		 ("\\paragraph{%s}" . "\\paragraph*{%s}")
		 ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
  (put 'downcase-region 'disabled nil)
#+END_SRC
** setup org-mode key bindings
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c c") 'org-capture)
#+END_SRC
** setup plantuml
#+begin_src emacs-lisp
  (use-package plantuml-mode
    :ensure t)
  (setq plantuml-default-exec-mode 'jar)
  (setq plantuml-jar-path "~/org/lib/plantuml-1.2022.2.jar")
  ;; fix problem with autoindenting
  (setq org-adapt-indentation nil)
  ;; (setq org-plantuml-jar-path
  (setq org-plantuml-jar-path (expand-file-name "~/org/lib/plantuml-1.2022.2.jar"))
  ;; enable plantuml-mode for PLANTUML files
  (add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
  (add-to-list 'auto-mode-alist '("\\.plantuml\\'" . plantuml-mode))

  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '(;; other Babel languages
       (plantuml . t))))
#+END_SRC
** configure babel languages
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t )
     (python . t )
     (java . t)
     (js . t)))
#+end_src
** setup reveal (for html presentations)
#+begin_src emacs-lisp
  ;; (add-to-list 'load-path "~/org/lib/org-reveal/")
  ;; (require 'ox-reveal) 			;manually installed
  ;; ;; (use-package org-reveal
  ;; ;;   :ensure t)
#+end_src
