config.org
** setup org-roam repository and configurations
#+begin_src emacs-lisp :lexical t
  ;; dependencies for org-roam
  (use-package emacsql-sqlite3
    :ensure t)
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; BEGIN HELPER FUNCTIONS                                               ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; --------------------------------------------------
  ;; insert topic node immediately without opening buffer
  ;; --------------------------------------------------
  (defun org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (push arg args))
	  (org-roam-capture-templates (list (append (car org-roam-capture-templates)
						    '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))
  ;; --------------------------------------------------
  ;; Keep an inbox of notes and tasks
  ;; --------------------------------------------------
  (defun my/org-roam-capture-inbox ()
    (interactive)
    (org-roam-capture- :node (org-roam-node-create)
		       :templates '(("i" "inbox" plain "** %?"
				     :if-new (file+head "Inbox.org" "#+title: Inbox\n")))))
  ;; --------------------------------------------------
  ;; build org agenda from org-roam notes
  ;; --------------------------------------------------
  ;; (defun my/org-roam-filter-by-tag (tag-name)
  ;;   (lambda (node)
  ;;     (member tag-name (org-roam-node-tags node))))
  (defun my/org-roam-list-notes-by-tag (tag-name)
    (mapcar #'org-roam-node-file
	    (seq-filter
	     (lambda (node)
	       (member "Project" (org-roam-node-tags node)))
	     ;; (my/org-roam-filter-by-tag tag-name)
	     (org-roam-node-list))))
  (defun my/org-roam-refresh-agenda-list ()
    (interactive)
    (setq org-agenda-files (my/org-roam-list-notes-by-tag "Project")))
  ;; --------------------------------------------------
  ;; selecting from a liste of notes with a specific tag
  ;; --------------------------------------------------
  (defun my/org-roam-project-finalize-hook ()
    "Adds the captured project file to `org-agenda-files' if the
    capture was not aborted."
    ;; Remove the hook since it was added temporarily
    (remove-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
    ;; Add project file to the agenda list if the capture was confirmed
    (unless org-note-abort
      (with-current-buffer (org-capture-get :buffer)
	(add-to-list 'org-agenda-files (buffer-file-name)))))
  (defun my/org-roam-find-project ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)
    ;; Select a project file to open, creating it if necessary
    (org-roam-node-find
     nil
     nil
     (lambda (node)
       (member "Project" (org-roam-node-tags node)))
     ;; (my/org-roam-filter-by-tag "Project")
     :templates
     '(("p" "project" plain (file "~/org-roam/templates/ProjectTemplate.org")
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+category: \n#+filetags: Project\n#+date: %U\n")
	:unnarrowed t))))
  ;; --------------------------------------------------
  ;; capture tasks directly into a specific project
  ;; --------------------------------------------------
  (defun my/org-roam-capture-task ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)

    ;; Capture the new task, creating the project file if necessary
    (org-roam-capture- :node (org-roam-node-read
			      nil
			      (lambda (node)
				(member "Project" (org-roam-node-tags node))))
		       ;; (my/org-roam-filter-by-tag "Project"))
		       :templates '(("p" "project" plain "** TODO %?"
				     :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
							    "#+title: ${title}\n#+category: \n#+filetags: Project\n#+date: %U\n"
							    ("Tasks"))))))
  ;; --------------------------------------------------
  ;; automatically copy completed tasks to dailies
  ;; --------------------------------------------------
  (defun my/org-roam-copy-todo-to-today ()
    (interactive)
    (let ((org-refile-keep t) ;; Set this to nil to delete the original!
	  (org-roam-dailies-capture-templates
	   '(("t" "tasks" entry "%?"
	      :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n" ("Accomplishments")))))
	  (org-after-refile-insert-hook #'save-buffer)
	  today-file
	  pos)
      (save-window-excursion
	(org-roam-dailies--capture (current-time) t)
	(setq today-file (buffer-file-name))
	(setq pos (point)))
      ;; Only refile if the target file is different than the current file
      (unless (equal (file-truename today-file)
		     (file-truename (buffer-file-name)))
	(org-refile nil nil (list "Accomplishments" today-file nil pos)))))

  (add-to-list 'org-after-todo-state-change-hook
	       (lambda ()
		 (when (equal org-state "DONE")
		   (my/org-roam-copy-todo-to-today))))
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; END HELPER FUNCTIONS                                                 ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ;; org-roam setup
  (use-package org-roam
    :ensure t
    :init
    (setq org-roam-v2-ack t)
    ;; (setq org-roam-node-display-template "${directories:10} ${tags:10} ${title:100} ${backlinkscount:6}")
    :custom
    (org-roam-directory (file-truename "~/org-roam"))
    (org-roam-completion-everywhere t)
    (org-roam-capture-templates
     '(("t" "topic" plain
	(file "~/org-roam/templates/Topic.org" )
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
	:unnarrowed t)
       ("u" "quote" plain
	(file "~/org-roam/templates/QuoteTemplate.org")
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Quote\n#+date: %U\n")
	:unnarrowed t)
       ("b" "book reference" plain
	(file "~/org-roam/templates/BookNoteTemplate.org")
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Reference Document\n#+date: %U\n")
	:unnarrowed t)
       ("p" "project" plain
	(file "~/org-roam/templates/ProjectTemplate.org")
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+category: \n#+filetags: Project\n#+date: %U\n")
	:unnarrowed t)
       ("g" "graphic" plain
	(file "~/org-roam/templates/Graphic.org" )
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
	:unnarrowed t)))
    (org-roam-dailies-capture-templates
     '(("d" "default" entry "* %<%I:%M %p>: \n%?"
	:if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
    :bind (("C-c n l" . org-roam-buffer-toggle)
	   ("C-c n f" . org-roam-node-find)
	   ("C-c n i" . org-roam-node-insert)
	   ("C-c n I" . org-roam-node-insert-immediate)
	   ("C-c n b" . my/org-roam-capture-inbox)
	   ("C-c n p" . my/org-roam-find-project)
	   ("C-c n t" . my/org-roam-capture-task)
	   :map org-mode-map
	   ("C-M-i" . completion-at-point))
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    (require 'org-roam-dailies)		;ensure the keymap is available
    ;; (org-roam-setup)
    (org-roam-db-autosync-mode)
    (my/org-roam-refresh-agenda-list))   ;; Build the agenda list the first time for the session)
  ;; --- END HELPER FUNCTIONS ---
#+end_src
